sample/imaging/SetImagingSettings.req.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <timg:SetImagingSettings>
      <timg:VideoSourceToken>VideoSource_1</timg:VideoSourceToken>
      <timg:ImagingSettings>
        <tt:Exposure>
          <tt:Mode>Manual</tt:Mode>
          <tt:Iris>1000</tt:Iris>
        </tt:Exposure>
      </timg:ImagingSettings>
    </timg:SetImagingSettings>
  </s:Body>
</s:Envelope>
